FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32u5/stm32u5_rtc.c
/****************************************************************************
 * arch/arm/src/stm32u5/stm32u5_rtc.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdbool.h>
#include <time.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/timers/rtc.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_rcc.h"
#include "stm32_pwr.h"
#include "hardware/stm32u5_rtcc.h"
#include "stm32u5_rtc.h"

#ifdef CONFIG_RTC

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

#ifndef CONFIG_RTC_DATETIME
#  error "CONFIG_RTC_DATETIME must be provided"
#endif

#ifdef CONFIG_RTC_ALARM
#  ifndef CONFIG_RTC_ALARM
#    error "CONFIG_RTC_ALARM must be provided"
#  endif
#endif

/* If CONFIG_RTC_ABSOLUTE_MAXDATE is defined, then check if the time to be
 * set is reasonable. The check is performed at the granularity of seconds.
 * Since the check is performed at the granularity of seconds, the
 * configuration really should be larger than 1 second to be effective.
 */

#ifdef CONFIG_RTC_ABSOLUTE_MAXDATE
#  define RTC_ABSOLUTE_MAXDATE_TS (time_t)((CONFIG_RTC_ABSOLUTE_MAXDATE_YEAR << 16) | \
                                       (CONFIG_RTC_ABSOLUTE_MAXDATE_MONTH << 8) | \
                                       (CONFIG_RTC_ABSOLUTE_MAXDATE_DAY))
#  define RTC_ABSOLUTE_MAXDATE_SEC (mktime(gmtime(&RTC_ABSOLUTE_MAXDATE_TS)))
#endif

/* If CONFIG_RTC_ABSOLUTE_MINDATE is defined, then check if the time to be
 * set is reasonable. The check is performed at the granularity of seconds.
 * Since the check is performed at the granularity of seconds, the
 * configuration really should be larger than 1 second to be effective.
 */

#ifdef CONFIG_RTC_ABSOLUTE_MINDATE
#  define RTC_ABSOLUTE_MINDATE_TS (time_t)((CONFIG_RTC_ABSOLUTE_MINDATE_YEAR << 16) | \
                                       (CONFIG_RTC_ABSOLUTE_MINDATE_MONTH << 8) | \
                                       (CONFIG_RTC_ABSOLUTE_MINDATE_DAY))
#  define RTC_ABSOLUTE_MINDATE_SEC (mktime(gmtime(&RTC_ABSOLUTE_MINDATE_TS)))
#endif

/* Debug ******************************************************************************/

#ifdef CONFIG_DEBUG_RTC_INFO
#  define rtcinfo(format, ...)       _info(format, ##__VA_ARGS__)
#else
#  define rtcinfo(format, ...)       (void)0
#endif

#ifdef CONFIG_DEBUG_RTC_ERROR
#  define rtcerr(format, ...)        _err(format, ##__VA_ARGS__)
#else
#  define rtcerr(format, ...)        (void)0
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Watchdog private data used to manage the RTC initialization and alarm
 * callbacks.
 */

static struct stm32u5_rtc_dev_s
{
  volatile bool init;        /* True: RTC has been initialized */
  volatile bool have_dtime;  /* True: A valid date time has been set */
#ifdef CONFIG_RTC_ALARM
  volatile bool alen[RTC_ALARM_LAST]; /* True: Alarm is enabled */
  alm_callback_t cb[RTC_ALARM_LAST];  /* Callback when the alarm expires */
  void *priv[RTC_ALARM_LAST];         /* Private data passed with the callback */
#endif
#ifdef CONFIG_RTC_PERIODIC
  wakeupcb_t periodic_cb;             /* Callback when the periodic wakes up */
#endif
} g_rtc_dev;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_rtc_sync
 *
 * Description:
 *   Wait for synchronisation between the RTC registers and the APB domain.
 *
 ****************************************************************************/

static inline int stm32_rtc_sync(void)
{
  volatile int timeout = 0xfff;

  /* Clear the RSF flag */

  modifyreg32(STM32U5_RTC_ISR, 0, RTC_ISR_RSF);

  /* Loop while the register is not synchronized */

  while (!(getreg32(STM32U5_RTC_ISR) & RTC_ISR_RSF) && timeout-- > 0)
    {
      up_udelay(1);
    }

  return timeout > 0 ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: stm32_rtc_enter_init
 *
 * Description:
 *   Enter initialization mode.
 *
 ****************************************************************************/

static inline int stm32_rtc_enter_init(void)
{
  int timeout = 0xfff;

  /* Enter init mode */

  modifyreg32(STM32U5_RTC_ISR, 0, RTC_ISR_INIT);

  /* Wait until init mode is entered */

  while (!(getreg32(STM32U5_RTC_ISR) & RTC_ISR_INITF) && timeout-- > 0)
    {
      up_udelay(1);
    }

  return timeout > 0 ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: stm32_rtc_exit_init
 *
 * Description:
 *   Exit initialization mode.
 *
 ****************************************************************************/

static inline void stm32_rtc_exit_init(void)
{
  /* Clear INIT bit to exit initialization mode */

  modifyreg32(STM32U5_RTC_ISR, RTC_ISR_INIT, 0);
}

/****************************************************************************
 * Name: stm32_rtc_bin2bcd
 *
 * Description:
 *   Convert a 2 digit binary to BCD format
 *
 ****************************************************************************/

static uint32_t stm32_rtc_bin2bcd(int value)
{
  uint32_t tens = value / 10;
  return (tens << 4) | (value - tens * 10);
}

/****************************************************************************
 * Name: stm32_rtc_bcd2bin
 *
 * Description:
 *   Convert a 2 digit BCD to binary format
 *
 ****************************************************************************/

static int stm32_rtc_bcd2bin(uint32_t value)
{
  uint32_t tens = ((value & 0xf0) >> 4) * 10;
  return tens + (value & 0x0f);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32u5_rtc_is_initialized
 *
 * Description:
 *    Returns 'true' if the RTC has been initialized
 *    Returns 'false' if the RTC has never been initialized since first time
 *    power up, and the counters are stopped until it is first initialized.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Returns true if RTC has been initialized.
 *
 ****************************************************************************/

bool stm32u5_rtc_is_initialized(void)
{
  return g_rtc_dev.init;
}

/****************************************************************************
 * Name: stm32u5_rtc_havesettime
 *
 * Description:
 *   Check if RTC time has been set.
 *
 * Returned Value:
 *   Returns true if RTC date-time have been previously set.
 *
 ****************************************************************************/

bool stm32u5_rtc_havesettime(void)
{
  return g_rtc_dev.have_dtime;
}

/****************************************************************************
 * Name: stm32u5_rtc_setdatetime
 *
 * Description:
 *   Set the RTC to the provided time. RTC implementations which provide
 *   up_rtc_getdatetime() (CONFIG_RTC_DATETIME is selected) should provide
 *   this function.
 *
 * Input Parameters:
 *   tp - the time to use
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_DATETIME
int stm32u5_rtc_setdatetime(const struct tm *tp)
{
  uint32_t tr;
  uint32_t dr;
  uint32_t cr;
  int ret;

  rtcinfo("Setting time to %" PRId32 ":%" PRId32 ":%" PRId32 "\n",
          tp->tm_hour, tp->tm_min, tp->tm_sec);

  /* Sample the time and date registers to ensure that they are stable */

  ret = stm32_rtc_sync();
  if (ret < 0)
    {
      rtcerr("ERROR: RTC sync failed: %d\n", ret);
      return ret;
    }

  /* Get current control register and disable calendar update */

  cr = getreg32(STM32U5_RTC_CR) & ~RTC_CR_BYPSHAD;

  /* Convert the struct tm format to RTC time and date formats */

  tr = (stm32_rtc_bin2bcd(tp->tm_sec)  << RTC_TR_SU_SHIFT) |
       (stm32_rtc_bin2bcd(tp->tm_min)  << RTC_TR_MNU_SHIFT) |
       (stm32_rtc_bin2bcd(tp->tm_hour) << RTC_TR_HU_SHIFT);

