FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32u5/stm32u5_rtc.c
  dr = (stm32_rtc_bin2bcd(tp->tm_year - 100) << RTC_DR_YU_SHIFT) |
       (stm32_rtc_bin2bcd(tp->tm_mon + 1)    << RTC_DR_MU_SHIFT) |
       (stm32_rtc_bin2bcd(tp->tm_mday)       << RTC_DR_DU_SHIFT);

  /* The value of the year field is limited to the range [0,99]. */

  if (tp->tm_year > 199 || tp->tm_year < 100)
    {
      rtcerr("ERROR: Year must be in range 2000-2099.  Setting %d\n",
             tp->tm_year + 1900);
      return -EINVAL;
    }

  /* Disable the write protection before accessing the RTC registers */

  stm32_rtc_writeprotect(false);

  /* Enter initialization mode */

  ret = stm32_rtc_enter_init();
  if (ret < 0)
    {
      rtcerr("ERROR: Failed to enter init mode: %d\n", ret);
      goto errout_with_protect;
    }

  /* Set the TR and DR registers */

  putreg32(tr, STM32U5_RTC_TR);
  putreg32(dr, STM32U5_RTC_DR);

  /* Exit initialization mode */

  stm32_rtc_exit_init();

  /* Re-enable the write protection */

  stm32_rtc_writeprotect(true);

  /* Remember that the RTC has been initialized */

  g_rtc_dev.init        = true;
  g_rtc_dev.have_dtime  = true;

  rtcinfo("  tr: %08" PRIx32 " dr: %08" PRIx32 "\n", tr, dr);
  return OK;

errout_with_protect:
  stm32_rtc_writeprotect(true);
  return ret;
}
#endif

/****************************************************************************
 * Name: stm32u5_rtc_getdatetime_with_subseconds
 *
 * Description:
 *   Get the current date and time from the date/time RTC.  This interface
 *   is only supported by the date/time RTC hardware implementation.
 *   It is used to replace the system timer.  It is only used by the RTOS
 *   during initialization to set up the system time when CONFIG_RTC and
 *   CONFIG_RTC_DATETIME are selected (and CONFIG_RTC_HIRES is not).
 *
 *   NOTE: The sub-second accuracy is returned through 'nsec'.
 *
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *   nsec - The location to return the subsecond time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_STM32U5_HAVE_RTC_SUBSECONDS
int stm32u5_rtc_getdatetime_with_subseconds(struct tm *tp, long *nsec)
{
  uint32_t ssr;
  uint32_t tr;
  uint32_t dr;
  uint32_t tmp;
  int ret;

  /* Sample the time and date registers to ensure that they are stable */

  ret = stm32_rtc_sync();
  if (ret < 0)
    {
      rtcerr("ERROR: RTC sync failed: %d\n", ret);
      return ret;
    }

  /* Get the current date and time */

  tr = getreg32(STM32U5_RTC_TR);
  dr = getreg32(STM32U5_RTC_DR);
  ssr = getreg32(STM32U5_RTC_SSR);

  /* Convert the RTC time and date structures to the struct tm format */

  tmp = (tr & RTC_TR_SU_MASK) >> RTC_TR_SU_SHIFT;
  tp->tm_sec = stm32_rtc_bcd2bin(tmp);

  tmp = (tr & RTC_TR_MNU_MASK) >> RTC_TR_MNU_SHIFT;
  tp->tm_min = stm32_rtc_bcd2bin(tmp);

  tmp = (tr & RTC_TR_HU_MASK) >> RTC_TR_HU_SHIFT;
  tp->tm_hour = stm32_rtc_bcd2bin(tmp);

  tmp = (dr & RTC_DR_DU_MASK) >> RTC_DR_DU_SHIFT;
  tp->tm_mday = stm32_rtc_bcd2bin(tmp);

  tmp = (dr & RTC_DR_MU_MASK) >> RTC_DR_MU_SHIFT;
  tp->tm_mon = stm32_rtc_bcd2bin(tmp) - 1;

  tmp = (dr & RTC_DR_YU_MASK) >> RTC_DR_YU_SHIFT;
  tp->tm_year = stm32_rtc_bcd2bin(tmp) + 100;

  /* Get sub-seconds in nanoseconds.
   * The range of the sub second register is [0, 2^15-1] where 2^15 = 32768
   */

  if (nsec)
    {
      *nsec = (((uint32_t)32767 - ssr) * NSEC_PER_SEC) / 32768;
    }

  rtcinfo("  tr: %08" PRIx32 " dr: %08" PRIx32 " ssr: %08" PRIx32
          " "
          "year: %d month: %d mday: %d "
          "hour: %d min: %d sec: %d\n",
          tr, dr, ssr,
          tp->tm_year + 1900, tp->tm_mon + 1, tp->tm_mday,
          tp->tm_hour, tp->tm_min, tp->tm_sec);

  return OK;
}
#endif

/****************************************************************************
 * Name: stm32_rtc_writeprotect
 *
 * Description:
 *   Enable or disable write protection to the RTC registers
 *
 ****************************************************************************/

void stm32_rtc_writeprotect(bool en)
{
  uint32_t regval;

  if (en)
    {
      /* Enable write protection */

      regval = getreg32(STM32U5_RTC_WPR);
      regval = (regval & ~RTC_WPR_KEY_MASK) | (0xff << RTC_WPR_KEY_SHIFT);
      putreg32(regval, STM32U5_RTC_WPR);
    }
  else
    {
      /* Disable write protection sequence:
       * Write 0xca to RTC_WPR
       * Write 0x53 to RTC_WPR
       */

      putreg32(0xca, STM32U5_RTC_WPR);
      putreg32(0x53, STM32U5_RTC_WPR);
    }
}

/****************************************************************************
 * Name: stm32_rtc_rinit
 *
 * Description:
 *   Initialize the hardware RTC per the selected configuration.  This
 *   function is called once during the OS initialization sequence.
 *
 ****************************************************************************/

int stm32_rtc_rinit(void)
{
  uint32_t regval;
  int ret;

  /* Enable the backup domain access */

  stm32_pwr_enablebkp(true);

  /* Check if the RTC has already been initialized */

  if (g_rtc_dev.init)
    {
      /* Already initialized... Just return */

      return OK;
    }

  /* Enable the LSE oscillator and select it as the RTC clock */

#if defined(CONFIG_STM32U5_RTC_HSECLOCK)
  /* Use HSE clock */

  /* Enable the external high-speed oscillator (HSE) */

  regval  = getreg32(STM32_RCC_CR);
  regval |= RCC_CR_HSEON;           /* Enable HSE */
  putreg32(regval, STM32_RCC_CR);

  /* Wait until the HSE is ready */

  while ((getreg32(STM32_RCC_CR) & RCC_CR_HSERDY) == 0)
    {
      /* Loop until HSE is ready */
    }

  /* Set the RTC clock source */

  regval = getreg32(STM32_RCC_BDCR);
  regval &= ~RCC_BDCR_RTCSEL_MASK;
  regval |= RCC_BDCR_RTCSEL_HSEDIV; /* Use HSE/128 */
  putreg32(regval, STM32_RCC_BDCR);

#elif defined(CONFIG_STM32U5_RTC_LSICLOCK)
  /* Use LSI clock */

  /* Enable the internal low-speed oscillator (LSI) */

  stm32_rcc_enablelsi();

  /* Set the RTC clock source */

  regval = getreg32(STM32_RCC_BDCR);
  regval &= ~RCC_BDCR_RTCSEL_MASK;
  regval |= RCC_BDCR_RTCSEL_LSI;
  putreg32(regval, STM32_RCC_BDCR);

#else
  /* Use LSE clock (most common) */

