FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32u5/stm32u5_rtc.c
  /* Enable the external low-speed oscillator (LSE) */

  stm32_rcc_enablelse();

  /* Set the RTC clock source */

  regval = getreg32(STM32_RCC_BDCR);
  regval &= ~RCC_BDCR_RTCSEL_MASK;
  regval |= RCC_BDCR_RTCSEL_LSE;
  putreg32(regval, STM32_RCC_BDCR);

#endif

  /* Enable the RTC clock */

  regval = getreg32(STM32_RCC_BDCR);
  regval |= RCC_BDCR_RTCEN;
  putreg32(regval, STM32_RCC_BDCR);

  /* Disable the write protection before accessing the RTC registers */

  stm32_rtc_writeprotect(false);

  /* Enter initialization mode */

  ret = stm32_rtc_enter_init();
  if (ret < 0)
    {
      rtcerr("ERROR: Failed to enter init mode: %d\n", ret);
      goto errout_with_protect;
    }

  /* Set the prescaler for the RTC.
   * Use the most common 32.768 KHz LSE oscillator:
   * RTC period = RTCCLK / (PREDIV_A + 1) / (PREDIV_S + 1)
   * For RTCCLK = 32.768 KHz, PREDIV_A = 0x7f, PREDIV_S = 0x00ff
   * gives a RTC period of 1 second.
   */

  putreg32((RTC_PRER_PREDIV_A_MASK & (0x7f << RTC_PRER_PREDIV_A_SHIFT)) |
           (RTC_PRER_PREDIV_S_MASK & (0x00ff << RTC_PRER_PREDIV_S_SHIFT)),
           STM32U5_RTC_PRER);

  /* Exit initialization mode */

  stm32_rtc_exit_init();

  /* Enable the write protection */

  stm32_rtc_writeprotect(true);

  /* Remember that the RTC has been initialized */

  g_rtc_dev.init        = true;
  g_rtc_dev.have_dtime  = false;

  return OK;

errout_with_protect:
  stm32_rtc_writeprotect(true);
  return ret;
}

/****************************************************************************
 * Name: stm32u5_rtc_setperiodic
 *
 * Description:
 *   Set a periodic RTC wakeup
 *
 * Input Parameters:
 *  period   - Time to sleep between wakeups
 *  callback - Function to call when the period expires.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_PERIODIC
int stm32u5_rtc_setperiodic(const struct timespec *period,
                             wakeupcb_t callback)
{
  uint32_t wutr;
  uint32_t cr;
  int ret;

  /* Sample the time and date registers to ensure that they are stable */

  ret = stm32_rtc_sync();
  if (ret < 0)
    {
      rtcerr("ERROR: RTC sync failed: %d\n", ret);
      return ret;
    }

  /* Calculate the wakeup timer value. Since the period is given in
   * seconds, and we are using a 1-second prescaler, the WUTR value is
   * the same as the number of seconds.
   */

  if (period->tv_sec < 1 || period->tv_sec > 0xffff)
    {
      return -ERANGE;
    }

  wutr = period->tv_sec - 1;

  /* Disable the write protection before accessing the RTC registers */

  stm32_rtc_writeprotect(false);

  /* Enter initialization mode */

  ret = stm32_rtc_enter_init();
  if (ret < 0)
    {
      rtcerr("ERROR: Failed to enter init mode: %d\n", ret);
      goto errout_with_protect;
    }

  /* Set the wakeup timer register */

  putreg32(wutr, STM32U5_RTC_WUTR);

  /* Exit initialization mode */

  stm32_rtc_exit_init();

  /* Save the callback */

  g_rtc_dev.periodic_cb = callback;

  /* Configure the control register */

  cr = getreg32(STM32U5_RTC_CR);

  /* Clear the WUTIE and WUTE bits */

  cr &= ~(RTC_CR_WUTIE | RTC_CR_WUTE);

  /* Select the desired clock source (currently defaulting to CK_SPRE) */

  cr &= ~RTC_CR_WUCKSEL_MASK;
  cr |= RTC_CR_WUCKSEL_CK_SPRE_16BIT;

  /* Set the WUTE bit to enable the wakeup timer */

  cr |= RTC_CR_WUTE;

#ifdef CONFIG_RTC_PERIODIC_HIRES
  /* Enable the wakeup timer interrupt if a callback is provided */

  if (callback != NULL)
    {
      cr |= RTC_CR_WUTIE;
    }
#endif

  putreg32(cr, STM32U5_RTC_CR);

  /* Re-enable the write protection */

  stm32_rtc_writeprotect(true);

  return OK;

errout_with_protect:
  stm32_rtc_writeprotect(true);
  return ret;
}

/****************************************************************************
 * Name: stm32u5_rtc_cancelperiodic
 *
 * Description:
 *   Cancel a periodic wakeup
 *
 * Input Parameters:
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int stm32u5_rtc_cancelperiodic(void)
{
  uint32_t cr;

  /* Disable the write protection before accessing the RTC registers */

  stm32_rtc_writeprotect(false);

  /* Clear the WUTIE and WUTE bits */

  cr = getreg32(STM32U5_RTC_CR);
  cr &= ~(RTC_CR_WUTIE | RTC_CR_WUTE);
  putreg32(cr, STM32U5_RTC_CR);

  /* Clear the callback */

  g_rtc_dev.periodic_cb = NULL;

  /* Re-enable the write protection */

  stm32_rtc_writeprotect(true);

  return OK;
}
#endif /* CONFIG_RTC_PERIODIC */

#ifdef CONFIG_RTC_ALARM

/****************************************************************************
 * Name: stm32u5_rtc_setalarm
 *
 * Description:
 *   Set an alarm to an absolute time using associated hardware.
 *
 * Input Parameters:
 *  alminfo - Information about the alarm configuration.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int stm32u5_rtc_setalarm(struct alm_setalarm_s *alminfo)
{
  uint32_t tr;
  uint32_t dr;
  uint32_t tmp;
  uint32_t cr;
  irqstate_t flags;

  flags = enter_critical_section();

  switch (alminfo->as_id)
    {
      case RTC_ALARMA:
        {
          /* Clear flag to indicate that the alarm is no longer pending */

          g_rtc_dev.alen[RTC_ALARMA] = false;

          /* Disable the write protection before accessing the RTC registers */

          stm32_rtc_writeprotect(false);

          /* Set the alarm interrupt callback and argument */

          g_rtc_dev.cb[RTC_ALARMA]   = alminfo->as_cb;
          g_rtc_dev.priv[RTC_ALARMA] = alminfo->as_arg;

          /* Calculate the alarm time register values */

          dr = (stm32_rtc_bin2bcd(alminfo->as_time.tm_year - 100) << RTC_DR_YU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_mon + 1)    << RTC_DR_MU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_mday)       << RTC_DR_DU_SHIFT);

          tr = (stm32_rtc_bin2bcd(alminfo->as_time.tm_sec)  << RTC_ALRMXR_SU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_min)  << RTC_ALRMXR_MNU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_hour) << RTC_ALRMXR_HU_SHIFT);

          /* Store the alarm registers */

          putreg32(dr, STM32U5_RTC_ALRMADR);
          putreg32(tr, STM32U5_RTC_ALRMATR);

