FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32u5/stm32u5_rtc.c
          /* Clear the alarm interrupt enable and pending bits in the control and status registers */

          modifyreg32(STM32U5_RTC_CR, (RTC_CR_ALRAIE), 0);
          modifyreg32(STM32U5_RTC_ISR, RTC_ISR_ALRAF, 0);

          /* Set the alarm interrupt enable bit */

          modifyreg32(STM32U5_RTC_CR, 0, RTC_CR_ALRAIE);

          /* Enable the alarm */

          modifyreg32(STM32U5_RTC_CR, 0, RTC_CR_ALRAE);

          /* Re-enable the write protection */

          stm32_rtc_writeprotect(true);

          /* Remember that the alarm is set */

          g_rtc_dev.alen[RTC_ALARMA] = true;
          break;
        }

      case RTC_ALARMB:
        {
          /* Clear flag to indicate that the alarm is no longer pending */

          g_rtc_dev.alen[RTC_ALARMB] = false;

          /* Disable the write protection before accessing the RTC registers */

          stm32_rtc_writeprotect(false);

          /* Set the alarm interrupt callback and argument */

          g_rtc_dev.cb[RTC_ALARMB]   = alminfo->as_cb;
          g_rtc_dev.priv[RTC_ALARMB] = alminfo->as_arg;

          /* Calculate the alarm time register values */

          dr = (stm32_rtc_bin2bcd(alminfo->as_time.tm_year - 100) << RTC_DR_YU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_mon + 1)    << RTC_DR_MU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_mday)       << RTC_DR_DU_SHIFT);

          tr = (stm32_rtc_bin2bcd(alminfo->as_time.tm_sec)  << RTC_ALRMXR_SU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_min)  << RTC_ALRMXR_MNU_SHIFT) |
               (stm32_rtc_bin2bcd(alminfo->as_time.tm_hour) << RTC_ALRMXR_HU_SHIFT);

          /* Store the alarm registers */

          putreg32(dr, STM32U5_RTC_ALRMBDR);
          putreg32(tr, STM32U5_RTC_ALRMBTR);

          /* Clear the alarm interrupt enable and pending bits in the control and status registers */

          modifyreg32(STM32U5_RTC_CR, (RTC_CR_ALRBIE), 0);
          modifyreg32(STM32U5_RTC_ISR, RTC_ISR_ALRBF, 0);

          /* Set the alarm interrupt enable bit */

          modifyreg32(STM32U5_RTC_CR, 0, RTC_CR_ALRBIE);

          /* Enable the alarm */

          modifyreg32(STM32U5_RTC_CR, 0, RTC_CR_ALRBE);

          /* Re-enable the write protection */

          stm32_rtc_writeprotect(true);

          /* Remember that the alarm is set */

          g_rtc_dev.alen[RTC_ALARMB] = true;
          break;
        }

      default:
        {
          leave_critical_section(flags);
          return -EINVAL;
        }
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32u5_rtc_rdalarm
 *
 * Description:
 *   Query an alarm configured in hardware.
 *
 * Input Parameters:
 *  alminfo - Information about the alarm configuration.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int stm32u5_rtc_rdalarm(struct alm_rdalarm_s *alminfo)
{
  uint32_t tr;
  uint32_t dr;
  uint32_t tmp;

  switch (alminfo->ar_id)
    {
      case RTC_ALARMA:
        {
          if (!g_rtc_dev.alen[RTC_ALARMA])
            {
              return -ENOENT;
            }

          /* Sample the alarm register values */

          tr = getreg32(STM32U5_RTC_ALRMATR);
          dr = getreg32(STM32U5_RTC_ALRMADR);

          /* Convert the RTC alarm time and date structures to the struct tm format */

          tmp = (tr & RTC_ALRMXR_SU_MASK) >> RTC_ALRMXR_SU_SHIFT;
          alminfo->ar_time->tm_sec = stm32_rtc_bcd2bin(tmp);

          tmp = (tr & RTC_ALRMXR_MNU_MASK) >> RTC_ALRMXR_MNU_SHIFT;
          alminfo->ar_time->tm_min = stm32_rtc_bcd2bin(tmp);

          tmp = (tr & RTC_ALRMXR_HU_MASK) >> RTC_ALRMXR_HU_SHIFT;
          alminfo->ar_time->tm_hour = stm32_rtc_bcd2bin(tmp);

          tmp = (dr & RTC_DR_DU_MASK) >> RTC_DR_DU_SHIFT;
          alminfo->ar_time->tm_mday = stm32_rtc_bcd2bin(tmp);

          tmp = (dr & RTC_DR_MU_MASK) >> RTC_DR_MU_SHIFT;
          alminfo->ar_time->tm_mon = stm32_rtc_bcd2bin(tmp) - 1;

          tmp = (dr & RTC_DR_YU_MASK) >> RTC_DR_YU_SHIFT;
          alminfo->ar_time->tm_year = stm32_rtc_bcd2bin(tmp) + 100;

          break;
        }

      case RTC_ALARMB:
        {
          if (!g_rtc_dev.alen[RTC_ALARMB])
            {
              return -ENOENT;
            }

          /* Sample the alarm register values */

          tr = getreg32(STM32U5_RTC_ALRMBTR);
          dr = getreg32(STM32U5_RTC_ALRMBDR);

          /* Convert the RTC alarm time and date structures to the struct tm format */

          tmp = (tr & RTC_ALRMXR_SU_MASK) >> RTC_ALRMXR_SU_SHIFT;
          alminfo->ar_time->tm_sec = stm32_rtc_bcd2bin(tmp);

          tmp = (tr & RTC_ALRMXR_MNU_MASK) >> RTC_ALRMXR_MNU_SHIFT;
          alminfo->ar_time->tm_min = stm32_rtc_bcd2bin(tmp);

          tmp = (tr & RTC_ALRMXR_HU_MASK) >> RTC_ALRMXR_HU_SHIFT;
          alminfo->ar_time->tm_hour = stm32_rtc_bcd2bin(tmp);

          tmp = (dr & RTC_DR_DU_MASK) >> RTC_DR_DU_SHIFT;
          alminfo->ar_time->tm_mday = stm32_rtc_bcd2bin(tmp);

          tmp = (dr & RTC_DR_MU_MASK) >> RTC_DR_MU_SHIFT;
          alminfo->ar_time->tm_mon = stm32_rtc_bcd2bin(tmp) - 1;

          tmp = (dr & RTC_DR_YU_MASK) >> RTC_DR_YU_SHIFT;
          alminfo->ar_time->tm_year = stm32_rtc_bcd2bin(tmp) + 100;

          break;
        }

      default:
        {
          return -EINVAL;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: stm32u5_rtc_cancelalarm
 *
 * Description:
 *   Cancel an alarm.
 *
 * Input Parameters:
 *  alarmid - Identifies the alarm to be cancelled
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int stm32u5_rtc_cancelalarm(enum alm_id_e alarmid)
{
  irqstate_t flags;

  flags = enter_critical_section();

  switch (alarmid)
    {
      case RTC_ALARMA:
        {
          /* Disable the write protection before accessing the RTC registers */

          stm32_rtc_writeprotect(false);

          /* Disable the alarm */

          modifyreg32(STM32U5_RTC_CR, RTC_CR_ALRAE | RTC_CR_ALRAIE, 0);

          /* Clear the alarm pending flag */

