FeatherCore/FeatherOS/nuttx/arch/arm/src/stm32u5/stm32u5_rtc.c
          modifyreg32(STM32U5_RTC_ISR, RTC_ISR_ALRAF, 0);

          /* Re-enable the write protection */

          stm32_rtc_writeprotect(true);

          /* Clear the alarm callback and clear the alarm pending flag */

          g_rtc_dev.cb[RTC_ALARMA]   = NULL;
          g_rtc_dev.priv[RTC_ALARMA] = NULL;
          g_rtc_dev.alen[RTC_ALARMA] = false;
          break;
        }

      case RTC_ALARMB:
        {
          /* Disable the write protection before accessing the RTC registers */

          stm32_rtc_writeprotect(false);

          /* Disable the alarm */

          modifyreg32(STM32U5_RTC_CR, RTC_CR_ALRBE | RTC_CR_ALRBIE, 0);

          /* Clear the alarm pending flag */

          modifyreg32(STM32U5_RTC_ISR, RTC_ISR_ALRBF, 0);

          /* Re-enable the write protection */

          stm32_rtc_writeprotect(true);

          /* Clear the alarm callback and clear the alarm pending flag */

          g_rtc_dev.cb[RTC_ALARMB]   = NULL;
          g_rtc_dev.priv[RTC_ALARMB] = NULL;
          g_rtc_dev.alen[RTC_ALARMB] = false;
          break;
        }

      default:
        {
          leave_critical_section(flags);
          return -EINVAL;
        }
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: stm32_rtc_alarm_handler
 *
 * Description:
 *   RTC interrupt handler
 *
 ****************************************************************************/

int stm32_rtc_alarm_handler(int irq, void *context, void *arg)
{
  uint32_t isr;

  /* Get the status of the interrupts */

  isr = getreg32(STM32U5_RTC_ISR);

  /* Check for Alarm A interrupt */

  if ((isr & RTC_ISR_ALRAF) && g_rtc_dev.cb[RTC_ALARMA])
    {
      /* Acknowledge the source of the alarm */

      putreg32(RTC_ISR_ALRAF, STM32U5_RTC_ISR);

      /* Disable the write protection before accessing the RTC registers */

      stm32_rtc_writeprotect(false);

      /* Disable the alarm */

      modifyreg32(STM32U5_RTC_CR, RTC_CR_ALRAE, 0);

      /* Re-enable the write protection */

      stm32_rtc_writeprotect(true);

      /* Clear the alarm pending flag */

      g_rtc_dev.alen[RTC_ALARMA] = false;

      /* Call the alarm callback */

      g_rtc_dev.cb[RTC_ALARMA](g_rtc_dev.priv[RTC_ALARMA], RTC_ALARMA);
    }

  /* Check for Alarm B interrupt */

  if ((isr & RTC_ISR_ALRBF) && g_rtc_dev.cb[RTC_ALARMB])
    {
      /* Acknowledge the source of the alarm */

      putreg32(RTC_ISR_ALRBF, STM32U5_RTC_ISR);

      /* Disable the write protection before accessing the RTC registers */

      stm32_rtc_writeprotect(false);

      /* Disable the alarm */

      modifyreg32(STM32U5_RTC_CR, RTC_CR_ALRBE, 0);

      /* Re-enable the write protection */

      stm32_rtc_writeprotect(true);

      /* Clear the alarm pending flag */

      g_rtc_dev.alen[RTC_ALARMB] = false;

      /* Call the alarm callback */

      g_rtc_dev.cb[RTC_ALARMB](g_rtc_dev.priv[RTC_ALARMB], RTC_ALARMB);
    }

  return OK;
}
#endif /* CONFIG_RTC_ALARM */

/****************************************************************************
 * Name: stm32u5_rtc_lowerhalf
 *
 * Description:
 *   Instantiate the RTC lower half driver for the STM32U5.
 *
 ****************************************************************************/

#ifdef CONFIG_RTC_DRIVER
struct rtc_lowerhalf_s *stm32u5_rtc_lowerhalf(void)
{
  /* Implementation would go here if needed */

  return NULL;
}
#endif

#endif /* CONFIG_RTC */